{
	"paper": [
		"This is the test World",
		"I am testing the Dialog thingy"
	],
	"lamp": [
		"What a nice lamp",
		"This would look great in my office"
	],
	"bookcase": [
		"hmmm, there is a book here called \"101 your mom jokes\" by Sigmund Freud "
	],
	"doctordesk": [
		"The Doctor sits entirely still at his desk",
		"I hear a voice, not exactly sourced from an area but almost internalized in my mind",
		"Harold: add stuff here please key something something"
	],
	"deadend": [
		"Looks like this is a dead end"
	],
	"watercooler": [
		"Looks like this is a dead end",
		"but atleast there is a water cooler here, I am parched",
		"...",
		"I am not entirely sure this is water"
	],
	"mabelcrenshaw": [
		"Detective Thorne: (taking a cautious step into the room, scanning his surroundings) Hello? I’m… looking for someone. I don’t know if you can help me, but I need information about Dr. Finch. Who are you?",
		"Mabel Crenshaw: (without looking up from her knitting, smiling warmly)
 Oh, hello there, dear. You’re new, aren’t you? I don’t believe we’ve met. I’m Mabel, and this little gentleman here is Pickles. He’s quite the chatterbox, you know. Always telling me the most delightful stories about the neighbors.",
"Detective Thorne: I need to ask you some questions about your sessions with Dr. Finch. Anything unusual you can remember could help.",
"Mabel Crenshaw: (chuckling lightly, resuming her knitting)
 Oh, my sessions? They were always such a delight! We’d talk about everything—mostly what Pickles heard from his little outings. He’s quite the gossip, you know. Just last week, he told me all about Mrs. Holcomb’s new curtains. Green, with a dreadful pattern. I told Dr. Finch all about it, and he just laughed. Said I have an eye for detail, I do.",
"Detective Thorne: (growing impatient, but trying to stay calm)
 Mabel, this is important. I need you to focus. I’m not here for gossip. Did Dr. Finch seem worried or distracted during your last session? Did he mention anything strange or anyone following him?",
"Mabel Crenshaw: (frowns, pausing her knitting as if she’s searching her memory)
 Worried? Oh no, he didn’t seem worried at all. If anything, he was more interested in what Pickles had to say. (leans in closer, lowering her voice to a conspiratorial whisper) You know, Pickles noticed that Mr. Larson was acting very peculiar lately. He saw him sneaking out late at night with a suitcase. I told Dr. Finch, and he said it was probably nothing, but I could tell he was curious.",
"Detective Thorne: (running a hand through his hair, trying to cut through the irrelevant details)
 Mabel, please. I need you to think about Dr. Finch, not your neighbors. Did anything happen during your last session that felt out of place? Anything at all?",
"Mabel Crenshaw: (her face softens, looking almost wistful)
 Out of place? Hmm, well, Dr. Finch did seem a bit quieter than usual. He wasn’t laughing as much. But I just thought he was tired. I told him he needed a good nap, and he chuckled. Said he wished he had time for one. But he was kind as ever, listening to all of Pickles’s stories. Oh, did I mention Pickles saw Mrs. Holcomb’s cat climb up the oak tree again? Silly thing, it never learns.",
"Detective Thorne: (gritting his teeth, realizing he’s getting nowhere)
 Mabel, I’m sorry, but this is serious. Dr. Finch is dead. Someone killed him, and I need to find out who did it. I’m not here to listen to stories about your neighbors. Please, focus. Do you remember anything unusual—anyone who might have hurt him?",
"Mabel Crenshaw: (gasps, her hand going to her chest, her knitting needles stilling)
 Dead? Oh no, that can’t be. You must be mistaken, dear. Dr. Finch can’t be dead. I was just with him, you see. We were talking about Pickles’s latest adventure. He couldn’t be gone.",
"Pickles: (whimpers softly, looking up at Mabel with wide, worried eyes)",
"Detective Thorne: (softening slightly, realizing she doesn’t know and won’t understand)
 I’m sorry, Mabel. But I need you to try. I need you to remember your last moments with him. Did he seem frightened? Did anyone else come into the room?",
"Mabel Crenshaw: (her expression grows distant, like she’s peering through a fog)
 No, no one came in. It was just me, Pickles, and Dr. Finch. We were laughing, and then he asked me if I’d ever thought about moving to the seaside. Said it sounded like a lovely place to retire. I thought it was an odd question, but I didn’t mind. We just talked, like we always do. (looks up at Thorne, her smile returning, fragile but genuine) You know, he really liked hearing about Pickles’s stories. He said they brought him a little bit of joy.",
"Detective Thorne: (realizing he’s reached a dead end, sighing heavily)
 Thank you, Mabel. I’m sorry to trouble you. I guess I should be going now.",
"Mabel Crenshaw: (beams, as if they’ve just shared a pleasant chat over tea)
 Oh, it’s no trouble at all, dear. You’re a kind man, just like Dr. Finch. I’m sure you’ll sort this whole mess out. And don’t forget—if you ever want to know what’s really happening in the neighborhood, you just ask Pickles. He knows everything. (winks playfully)",
"Pickles: (barks once, almost as if in agreement, then settles back down at Mabel’s feet)",
"Detective Thorne: (stands up, the edges of the room beginning to blur and dissolve)
 I’ll keep that in mind, Mabel. Take care of yourself… and Pickles."
	]
}
