{
	"paper": [
		"This is the test World",
		"I am testing the Dialog thingy"
	],
	"lamp": [
		"What a nice lamp",
		"This would look great in my office"
	],
	"bookcase": [
		"hmmm, there is a book here called \"101 your mom jokes\" by Sigmund Freud "
	],
	"Interaction1": [
		"Detective Thorne: Hello? I’m… looking for someone. I don’t know if you can help me, but I need information about Dr. Finch. Who are you?",
		"Mabel Crenshaw: Oh, hello there, dear. You’re new, aren’t you? I don’t believe we’ve met. I’m Mabel, and this little gentleman here is Pickles.",
		"Mabel Crenshaw: He’s quite the chatterbox, you know. Always telling me the most delightful stories about the neighbors.",
		"Detective Thorne: I need to ask you some questions about your sessions with Dr. Finch. Anything unusual you can remember could help.",
		"Mabel Crenshaw: Oh, my sessions? They were always such a delight! We’d talk about everything—mostly what Pickles heard from his little outings.",
		"Mabel Crenshaw: He’s quite the gossip, you know. Just last week, he told me all about Mrs. Holcomb’s new curtains. Green, with a dreadful pattern.",
		"Mabel Crenshaw: I told Dr. Finch all about it, and he just laughed. Said I have an eye for detail, I do.",
		"Detective Thorne: Mabel, this is important. I need you to focus. I’m not here for gossip. Did Dr. Finch seem worried or distracted during your last session?",
		"Detective Thorne: Did he mention anything strange or anyone following him?",
		"Mabel Crenshaw: Worried? Oh no, he didn’t seem worried at all. If anything, he was more interested in what Pickles had to say.",
		"Mabel Crenshaw: You know, Pickles noticed that Mr. Larson was acting very peculiar lately. He saw him sneaking out late at night with a suitcase.",
		"Mabel Crenshaw: I told Dr. Finch, and he said it was probably nothing, but I could tell he was curious.",
		"Detective Thorne: Mabel, please. I need you to think about Dr. Finch, not your neighbors. Did anything happen during your last session that felt out of place?",
		"Detective Thorne: Anything at all?",
		"Mabel Crenshaw: Out of place? Hmm, well, Dr. Finch did seem a bit quieter than usual. He wasn’t laughing as much. But I just thought he was tired.",
		"Mabel Crenshaw: I told him he needed a good nap, and he chuckled. Said he wished he had time for one. But he was kind as ever, listening to all of Pickles’s stories.",
		"Mabel Crenshaw: Oh, did I mention Pickles saw Mrs. Holcomb’s cat climb up the oak tree again? Silly thing, it never learns.",
		"Detective Thorne:  Mabel, I’m sorry, but this is serious. Dr. Finch is dead. Someone killed him, and I need to find out who did it.",
		"Detective Thorne: I’m not here to listen to stories about your neighbors. Please, focus. Do you remember anything unusual—anyone who might have hurt him?",
		"Mabel Crenshaw: Dead? Oh no, that can’t be. You must be mistaken, dear. Dr. Finch can’t be dead. I was just with him, you see.",
		"Mabel Crenshaw: We were talking about Pickles’s latest adventure. He couldn’t be gone.",
		"Detective Thorne:  I’m sorry, Mabel. But I need you to try. I need you to remember your last moments with him. Did he seem frightened? Did anyone else come into the room?",
		"Mabel Crenshaw: No, no one came in. It was just me, Pickles, and Dr. Finch. We were laughing, and then he asked me if I’d ever thought about moving to the seaside.",
		"Mabel Crenshaw: Said it sounded like a lovely place to retire. I thought it was an odd question, but I didn’t mind. We just talked, like we always do.",
		"Mabel Crenshaw: You know, he really liked hearing about Pickles’s stories. He said they brought him a little bit of joy.",
		"Detective Thorne: Thank you, Mabel. I’m sorry to trouble you. I guess I should be going now.",
		"Mabel Crenshaw: Oh, it’s no trouble at all, dear. You’re a kind man, just like Dr. Finch. I’m sure you’ll sort this whole mess out. And don’t forget.",
		"Mabel Crenshaw: If you ever want to know what’s really happening in the neighborhood, you just ask Pickles. He knows everything.",
		"Detective Thorne: I’ll keep that in mind, Mabel. Take care of yourself and Pickles."
	],
	
	"Interaction2": [
		"Detective Thorne: Hello there. I didn’t expect to find someone else in here. I’m Jonah Thorne. I’m trying to figure out what happened to Dr. Finch.",
		"Detective Thorne: Do you mind if I ask you a few questions?",
		"Arnold: Oh, hi! I’m Arnoldd. You’re new here, huh? Dr. Finch doesn’t get many visitors like you. These photos are my little collection. My hobby, you could say.",
		"Arnold: Dr. Finch always liked seeing what I captured. Said it helped him understand people better.",
		"Detective Thorne: You’ve got quite the eye, Arnold. It’s like you’re capturing pieces of people’s lives they keep hidden.",
		"Detective Thorne: I was hoping maybe you could help me understand what happened to Dr. Finch. Did you take any photos of him?",
		"Arnold:  I’ve got a few of him. He never minded, really. He always looked a bit tired, though, like he had too much on his mind. Here, take a look.",
		"Arnold: He’s usually deep in thought. Like he’s in another world.",
		"Detective Thorne:  I can see what you mean. He looks… preoccupied. But tell me, Arnold, who else do you photograph? I’m curious about your collection.",
		"Arnold: Oh, you’ll love this part! I’ve got some great ones. Let me show you Marion first. She’s a sweet lady. Lives all alone but never seems lonely.",
		"Arnold: She makes her own dolls, you know. She even has tea parties with them every Tuesday at 3 p.m. sharp.",
		"Detective Thorne: She looks happy. You’ve captured something real there, Arnold. It’s like she’s living in her own little world, away from everything else.",
		"Arnold: Exactly! That’s what I love about her. She’s in her own bubble, and it’s like I get to peek inside without bursting it. Dr. Finch thought it was sweet, too.",
		"Arnold: He said it reminded him of simpler times. I like to think I’m just sharing in her little moments.",
		"Detective Thorne: It’s kind, what you do, Arnold. You’re seeing people when they’re truly themselves. Who else do you watch?",
		"Arnold: Oh, then you’ve got to see Derek! He’s an architect, always designing these fancy buildings by day, but at night… well, that’s when the fun begins.",
		"Detective Thorne:  Legos? I wouldn’t have guessed. He looks like he’s building his own little city in there.",
		"Arnold: Oh, he is! He’s like a kid again when he’s working with those bricks. I think it’s his way of relaxing.",
		"Arnold: He gets to make the world just the way he wants it, one piece at a time. It’s like a little escape for him. Dr. Finch loved hearing about Derek.",
		"Arnold: He said it was a sign of a creative mind, needing that kind of play.",
		"Detective Thorne: And what about this guy here? Who’s this? He looks like he’s having a blast.",
		"Arnold: Oh, that’s Darryl! He’s my favorite to watch. He’s a police officer during the day, but when he’s home alone, he becomes Captain Justice!",
		"Arnold: He even has a cape and everything. He sets up these big battles with action figures—heroes and villains. It’s like he’s a little boy again.",
		"Detective Thorne: Captain Justice, huh? That’s quite a transformation. You’ve got a lot of photos of him, Arnold. Does he know you’re watching?",
		"Arnold: Oh, no. I don’t think he’d like it if he knew. He’s a tough guy, you know? It’s his little secret, and I just… I like being a part of it, without getting in the way.",
		"Arnold: Dr. Finch told me to be careful, though. He said some secrets are heavier than others.",
		"Detective Thorne: Arnold, I need you to be honest with me. Did Dr. Finch ever mention showing these photos to anyone else? Did Darryl ever find out you were taking them?",
		"Arnold:  Well… there was this one time. I was at the office late, showing Dr. Finch my latest photos. I thought I heard someone at the door—heavy footsteps, you know?",
		"Arnold:  I peeked out, but I didn’t see anyone. After that, Dr. Finch seemed different, more serious. I think he was worried, but he didn’t say why.",
		"Detective Thorne: And have you seen Darryl since then? Has he been acting any differently?",
		"Arnold: I haven’t seen him as Captain Justice lately. He’s… different. He used to be so happy in his costume, but now he looks angry.",
		"Detective Thorne: Arnold, I think Darryl might have seen these photos. If he thought Dr. Finch was going to show them to someone, he might’ve panicked.",
		"Detective Thorne: This could be why the doctor… why he’s gone.",
		"Arnold:  No… I didn’t know. I never wanted to hurt anyone. I just wanted to see people happy, to share in their little joys. I thought I was capturing something good.",
		"Detective Thorne: You didn’t know, Arnold. You’ve helped me more than you realize. Sometimes people hide behind masks, even when they don’t mean to.",
		"Detective Thorne: I’m going to take care of this. You just keep seeing the good in people, alright? But maybe… be a little more careful next time.",
		"Arnold: Yeah, I’ll try. I just… I hope Captain Justice isn’t gone forever. He made the world feel a little brighter, you know?"
	],
	
	"Interation3": [
		"Darryl: Evening, Dr. Finch. I’m Officer Darryl Hayes. Hope I’m not interrupting you.",
		"Darryl: I’m here on official business, thought I’d ask for your input on a case we’re working on. Mind if I come in?",
		"Dr. Finch: Not at all, Officer Hayes. Please, take a seat. I wasn’t expecting a visit from the police tonight. How can I assist you?",
		"Darryl: Thanks, Doc. I appreciate you seeing me on such short notice. We’ve got a situation that’s been puzzling us, and I figured you might be the right person to help.",
		"Darryl: You deal with a lot of… unique cases, right? People with odd habits, secrets they don’t usually share.",
		"Dr. Finch: Yes, you could say that. I tend to work with patients who have unusual concerns or compulsions. It’s part of what I enjoy about this practice.",
		"Dr. Finch: But I’m bound by confidentiality, Officer. Is there something specific you’re looking into?",
		"Darryl: Right, right. I get that. It’s just that we’ve been hearing some strange stories lately. People acting out of character. And, well, your name came up in a few places.",
		"Darryl: Thought it’d be worth swinging by to see if you could shed some light on it.",
		"Dr. Finch: Strange stories? I’m not sure what you mean. Could you give me an example? I deal with a wide variety of cases, Officer Hayes.",
		"Dr. Finch: It’s hard to say what might seem unusual without more context.",
		"Darryl: Alright, Doc, I’ll level with you. Let’s say we’ve got a person of interest—someone who’s got a bit of a double life.",
		"Darryl: We’re concerned about what might happen if certain… behaviors were exposed.",
		"Darryl: Hypothetically speaking, if you had information about this kind of person, what would you do with it?",
		"Dr. Finch: Hypothetically, Officer Hayes, if I were aware of any dangerous behavior, I would be obligated to take the appropriate steps.",
		"Dr. Finch: But if you’re asking about personal secrets or quirks—things that aren’t harmful to others—those remain confidential.",
		"Dr. Finch: It’s my duty to protect my patients’ privacy. It’s the only way they can trust me.",
		"Darryl: Yeah, I figured you’d say that. You’re a professional, after all. But let’s say someone didn’t feel so safe anymore.",
		"Darryl: Let’s say they found out their private moments weren’t as private as they thought. That someone had been… watching them, taking photos, maybe even sharing them.",
		"Dr. Finch: That sounds very specific, Officer Hayes. I’m not sure I understand what you’re suggesting. Are you saying someone broke into my office?",
		"Dr. Finch: Or that there’s a concern about patient privacy being compromised?",
		"Darryl: Oh, I’m not saying anything like that, Doc. Just speaking hypothetically. It’s a messy world out there, you know?",
		"Darryl: People don’t always keep their secrets where they should. I’d hate for someone’s private business to get out. It could ruin a person’s life.",
		"Dr. Finch: You’re right—it’s important to keep private matters private. That’s why I take extra care to ensure my patients’ information is secure.",
		"Dr. Finch: If there’s been a breach of some kind, that’s very serious. I’d need to know more to address it properly.",
		"Darryl: Oh, I’m sure you keep things locked up tight, Doc. But you know how it is—locks can be picked, doors can be opened.",
		"Darryl: And sometimes people see things they weren’t meant to see.",
		"Dr. Finch:  You’re speaking from experience, Officer Hayes? It sounds like you might know more about this than you’re letting on.",
		"Darryl: I’m just saying it’d be a shame if someone had to deal with the fallout of something like that. People put on masks for a reason, Doc.",
		"Darryl: And when those masks get ripped off, it can get ugly fast.",
		"Dr. Finch: You’re right about that. It can be frightening to feel exposed.",
		"Dr. Finch: But I believe most people wear their masks because they’re afraid of being seen for who they really are.",
		"Dr. Finch: It doesn’t mean they’re dangerous—it just means they’re human.",
		"Darryl: Well, maybe I’m not as convinced as you are, Doc. But it’s good to know where you stand. Just remember—you’ve got a lot of people counting on you to keep things safe.",
		"Darryl: It’d be a real shame if someone ended up in the wrong place at the wrong time because of a misunderstanding.",
		"Dr. Finch: I appreciate the advice, Officer Hayes. And if there’s something specific you’re worried about, I’d suggest you speak plainly. I’m here to help, after all.",
		"Darryl: Oh, I’m speaking as plainly as I can, Doc. Just make sure you keep those files under lock and key. Some secrets are worth more than others."
	]
}
